# SweepBaseFloorSubcategoryId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SweepBaseFloorSubcategoryId Property
ParameterTypeId Class See Also
---
"Subcategory of Floors"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SweepBaseFloorSubcategoryId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SweepBaseFloorSubcategoryId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SweepBaseFloorSubcategoryId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace